cypress/performance/yaml.yml
config: 
  target: "https://httpbin.org/anything"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Goit Performance Test Odevi
  plugins:
    ensure:
      thresholds:
        - http.response_time.max: 2000
        - http.response_time.p99: 3000
  payload:
    - path: "ddd.csv"
      fields:
        - "keyword1"
        - "keyword2"
scenarios:
  - name: Get and Post
    flow:
      - get:
          url: "/get?param1={{keyword1}}"
      - post:
          url: "/post?param2={{keyword2}}"
        
          
          capture:
            - json: "$.json"
              as: "response_body"
            - json: "$.method"
              as: "method"
      - log: "Response Body : {{response_body}}"
      - log: "Method : {{method}}"
      - log: "ilk deger: {{keyword1}}"
      - log: "ikinci deger: {{keyword2}}"